
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>使用变量 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="section1.html" />
    
    
    <link rel="prev" href="../chapter1/section2.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../chapter1/">
            
                <a href="../chapter1/">
            
                    
                    Makefile介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../chapter1/section1.html">
            
                <a href="../chapter1/section1.html">
            
                    
                    书写规则
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../chapter1/section2.html">
            
                <a href="../chapter1/section2.html">
            
                    
                    书写命令
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.5" data-path="./">
            
                <a href="./">
            
                    
                    使用变量
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="section1.html">
            
                <a href="section1.html">
            
                    
                    使用条件判断
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="section2.html">
            
                <a href="section2.html">
            
                    
                    使用函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="../end/">
            
                <a href="../end/">
            
                    
                    结束
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >使用变量</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x4F7F;&#x7528;&#x53D8;&#x91CF;">&#x4F7F;&#x7528;&#x53D8;&#x91CF;</h1>
<p>&#x5728;Makefile&#x4E2D;&#x7684;&#x5B9A;&#x4E49;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x5C31;&#x50CF;&#x662F;C/C++&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x5B8F;&#x4E00;&#x6837;&#xFF0C;&#x4ED6;&#x4EE3;&#x8868;&#x4E86;&#x4E00;&#x4E2A;&#x6587;&#x672C;&#x5B57;&#x4E32;&#xFF0C;&#x5728;Makefile&#x4E2D; &#x6267;&#x884C;&#x7684;&#x65F6;&#x5019;&#x5176;&#x4F1A;&#x81EA;&#x52A8;&#x539F;&#x6A21;&#x539F;&#x6837;&#x5730;&#x5C55;&#x5F00;&#x5728;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x5730;&#x65B9;&#x3002;&#x5176;&#x4E0E;C/C++&#x6240;&#x4E0D;&#x540C;&#x7684;&#x662F;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;Makefile&#x4E2D;&#x6539;&#x53D8;&#x5176; &#x503C;&#x3002;&#x5728;Makefile&#x4E2D;&#xFF0C;&#x53D8;&#x91CF;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5728;&#x201C;&#x76EE;&#x6807;&#x201D;&#xFF0C;&#x201C;&#x4F9D;&#x8D56;&#x76EE;&#x6807;&#x201D;&#xFF0C; &#x201C;&#x547D;&#x4EE4;&#x201D;&#x6216;&#x662F;Makefile&#x7684;&#x5176;&#x5B83;&#x90E8;&#x5206;&#x4E2D;&#x3002;</p>
<p>&#x53D8;&#x91CF;&#x7684;&#x547D;&#x540D;&#x5B57;&#x53EF;&#x4EE5;&#x5305;&#x542B;&#x5B57;&#x7B26;&#x3001;&#x6570;&#x5B57;&#xFF0C;&#x4E0B;&#x5212;&#x7EBF;&#xFF08;&#x53EF;&#x4EE5;&#x662F;&#x6570;&#x5B57;&#x5F00;&#x5934;&#xFF09;&#xFF0C;&#x4F46;&#x4E0D;&#x5E94;&#x8BE5;&#x542B;&#x6709; : &#x3001; # &#x3001; = &#x6216;&#x662F;&#x7A7A;&#x5B57;&#x7B26;&#xFF08;&#x7A7A;&#x683C;&#x3001;&#x56DE;&#x8F66;&#x7B49;&#xFF09;&#x3002;&#x53D8;&#x91CF;&#x662F;&#x5927;&#x5C0F;&#x5199;&#x654F;&#x611F;&#x7684;&#xFF0C;&#x201C;foo&#x201D;&#x3001;&#x201C;Foo&#x201D;&#x548C;&#x201C;FOO&#x201D;&#x662F;&#x4E09;&#x4E2A;&#x4E0D;&#x540C;&#x7684; &#x53D8;&#x91CF;&#x540D;&#x3002;&#x4F20;&#x7EDF;&#x7684;Makefile&#x7684;&#x53D8;&#x91CF;&#x540D;&#x662F;&#x5168;&#x5927;&#x5199;&#x7684;&#x547D;&#x540D;&#x65B9;&#x5F0F;&#xFF0C;&#x4F46;&#x6211;&#x63A8;&#x8350;&#x4F7F;&#x7528;&#x5927;&#x5C0F;&#x5199;&#x642D;&#x914D;&#x7684;&#x53D8;&#x91CF;&#x540D;&#xFF0C;&#x5982;&#xFF1A; MakeFlags&#x3002;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x548C;&#x7CFB;&#x7EDF;&#x7684;&#x53D8;&#x91CF;&#x51B2;&#x7A81;&#xFF0C;&#x800C;&#x53D1;&#x751F;&#x610F;&#x5916;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x6709;&#x4E00;&#x4E9B;&#x53D8;&#x91CF;&#x662F;&#x5F88;&#x5947;&#x602A;&#x5B57;&#x4E32;&#xFF0C;&#x5982; $&lt; &#x3001; $@ &#x7B49;&#xFF0C;&#x8FD9;&#x4E9B;&#x662F;&#x81EA;&#x52A8;&#x5316;&#x53D8;&#x91CF;&#xFF0C;&#x6211;&#x4F1A;&#x5728;&#x540E;&#x9762;&#x4ECB;&#x7ECD;&#x3002;</p>
<h1 id="&#x53D8;&#x91CF;&#x7684;&#x57FA;&#x7840;">&#x53D8;&#x91CF;&#x7684;&#x57FA;&#x7840;</h1>
<p>&#x53D8;&#x91CF;&#x5728;&#x58F0;&#x660E;&#x65F6;&#x9700;&#x8981;&#x7ED9;&#x4E88;&#x521D;&#x503C;&#xFF0C;&#x800C;&#x5728;&#x4F7F;&#x7528;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x7ED9;&#x5728;&#x53D8;&#x91CF;&#x540D;&#x524D;&#x52A0;&#x4E0A; $ &#x7B26;&#x53F7;&#xFF0C;&#x4F46;&#x6700;&#x597D;&#x7528;&#x5C0F;&#x62EC;&#x53F7; () &#x6216;&#x662F;&#x5927;&#x62EC;&#x53F7; {} &#x628A;&#x53D8;&#x91CF;&#x7ED9;&#x5305;&#x62EC;&#x8D77;&#x6765;&#x3002;&#x5982;&#x679C;&#x4F60;&#x8981;&#x4F7F;&#x7528;&#x771F;&#x5B9E;&#x7684; $ &#x5B57;&#x7B26;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x9700;&#x8981;&#x7528; $$ &#x6765;&#x8868;&#x793A;&#x3002;</p>
<p>&#x53D8;&#x91CF;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5728;&#x8BB8;&#x591A;&#x5730;&#x65B9;&#xFF0C;&#x5982;&#x89C4;&#x5219;&#x4E2D;&#x7684;&#x201C;&#x76EE;&#x6807;&#x201D;&#x3001;&#x201C;&#x4F9D;&#x8D56;&#x201D;&#x3001;&#x201C;&#x547D;&#x4EE4;&#x201D;&#x4EE5;&#x53CA;&#x65B0;&#x7684;&#x53D8;&#x91CF;&#x4E2D;&#x3002;&#x5148;&#x770B;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code>objects = program.o foo.o utils.o
program : $(objects)
cc -o program $(objects)

$(objects) : defs.h
</code></pre><p>&#x53D8;&#x91CF;&#x4F1A;&#x5728;&#x4F7F;&#x7528;&#x5B83;&#x7684;&#x5730;&#x65B9;&#x7CBE;&#x786E;&#x5730;&#x5C55;&#x5F00;&#xFF0C;&#x5C31;&#x50CF;C/C++&#x4E2D;&#x7684;&#x5B8F;&#x4E00;&#x6837;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p>
<pre><code>foo = c
prog.o : prog.$(foo)
$(foo)$(foo) -$(foo) prog.$(foo)
</code></pre><p>&#x5C55;&#x5F00;&#x540E;&#x5F97;&#x5230;&#xFF1A;</p>
<pre><code>prog.o : prog.c
cc -c prog.c
</code></pre><p>&#x5F53;&#x7136;&#xFF0C;&#x5343;&#x4E07;&#x4E0D;&#x8981;&#x5728;&#x4F60;&#x7684;Makefile&#x4E2D;&#x8FD9;&#x6837;&#x5E72;&#xFF0C;&#x8FD9;&#x91CC;&#x53EA;&#x662F;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#x6765;&#x8868;&#x660E;Makefile&#x4E2D;&#x7684;&#x53D8;&#x91CF;&#x5728;&#x4F7F;&#x7528;&#x5904;&#x5C55;&#x5F00;&#x7684; &#x771F;&#x5B9E;&#x6837;&#x5B50;&#x3002;&#x53EF;&#x89C1;&#x5176;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x201C;&#x66FF;&#x4EE3;&#x201D;&#x7684;&#x539F;&#x7406;&#x3002;</p>
<p>&#x53E6;&#x5916;&#xFF0C;&#x7ED9;&#x53D8;&#x91CF;&#x52A0;&#x4E0A;&#x62EC;&#x53F7;&#x5B8C;&#x5168;&#x662F;&#x4E3A;&#x4E86;&#x66F4;&#x52A0;&#x5B89;&#x5168;&#x5730;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#xFF0C;&#x5728;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x60F3;&#x7ED9;&#x53D8;&#x91CF;&#x52A0;&#x4E0A; &#x62EC;&#x53F7;&#xFF0C;&#x90A3;&#x4E5F;&#x53EF;&#x4EE5;&#xFF0C;&#x4F46;&#x6211;&#x8FD8;&#x662F;&#x5F3A;&#x70C8;&#x5EFA;&#x8BAE;&#x4F60;&#x7ED9;&#x53D8;&#x91CF;&#x52A0;&#x4E0A;&#x62EC;&#x53F7;&#x3002;</p>
<h1 id="&#x53D8;&#x91CF;&#x4E2D;&#x7684;&#x53D8;&#x91CF;">&#x53D8;&#x91CF;&#x4E2D;&#x7684;&#x53D8;&#x91CF;</h1>
<p>&#x5728;&#x5B9A;&#x4E49;&#x53D8;&#x91CF;&#x7684;&#x503C;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5176;&#x5B83;&#x53D8;&#x91CF;&#x6765;&#x6784;&#x9020;&#x53D8;&#x91CF;&#x7684;&#x503C;&#xFF0C;&#x5728;Makefile&#x4E2D;&#x6709;&#x4E24;&#x79CD;&#x65B9;&#x5F0F;&#x6765;&#x5728;&#x7528;&#x53D8;&#x91CF;&#x5B9A;&#x4E49; &#x53D8;&#x91CF;&#x7684;&#x503C;&#x3002;</p>
<p>&#x5148;&#x770B;&#x7B2C;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x7B80;&#x5355;&#x7684;&#x4F7F;&#x7528; = &#x53F7;&#xFF0C;&#x5728; = &#x5DE6;&#x4FA7;&#x662F;&#x53D8;&#x91CF;&#xFF0C;&#x53F3;&#x4FA7;&#x662F;&#x53D8;&#x91CF;&#x7684;&#x503C;&#xFF0C;&#x53F3;&#x4FA7;&#x53D8;&#x91CF;&#x7684;&#x503C; &#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x5728;&#x6587;&#x4EF6;&#x7684;&#x4EFB;&#x4F55;&#x4E00;&#x5904;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x53F3;&#x4FA7;&#x4E2D;&#x7684;&#x53D8;&#x91CF;&#x4E0D;&#x4E00;&#x5B9A;&#x975E;&#x8981;&#x662F;&#x5DF2;&#x5B9A;&#x4E49;&#x597D;&#x7684;&#x503C;&#xFF0C;&#x5176;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x540E;&#x9762;&#x5B9A;&#x4E49;&#x7684;&#x503C;&#x3002;&#x5982;&#xFF1A;</p>
<pre><code>foo = $(bar)bar = $(ugh)ugh = Huh?

all:
echo $(foo)
</code></pre><p>&#x6211;&#x4EEC;&#x6267;&#x884C;&#x201C;make all&#x201D;&#x5C06;&#x4F1A;&#x6253;&#x51FA;&#x53D8;&#x91CF; $(foo) &#x7684;&#x503C;&#x662F; Huh? &#xFF08; $(foo) &#x7684;&#x503C;&#x662F; $(bar) &#xFF0C; $(bar) &#x7684;&#x503C;&#x662F; $(ugh) &#xFF0C; $(ugh) &#x7684;&#x503C;&#x662F; Huh? &#xFF09;&#x53EF;&#x89C1;&#xFF0C;&#x53D8; &#x91CF;&#x662F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x540E;&#x9762;&#x7684;&#x53D8;&#x91CF;&#x6765;&#x5B9A;&#x4E49;&#x7684;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#x6709;&#x597D;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x4E5F;&#x6709;&#x4E0D;&#x597D;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x597D;&#x7684;&#x5730;&#x65B9;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x628A;&#x53D8;&#x91CF;&#x7684;&#x771F;&#x5B9E;&#x503C;&#x63A8;&#x5230;&#x540E;&#x9762;&#x6765;&#x5B9A;&#x4E49;&#xFF0C;&#x5982;&#xFF1A;</p>
<pre><code>CFLAGS = $(include_dirs) -O
include_dirs = -Ifoo -Ibar
</code></pre><p>&#x5F53; CFLAGS &#x5728;&#x547D;&#x4EE4;&#x4E2D;&#x88AB;&#x5C55;&#x5F00;&#x65F6;&#xFF0C;&#x4F1A;&#x662F; -Ifoo -Ibar -O &#x3002;&#x4F46;&#x8FD9;&#x79CD;&#x5F62;&#x5F0F;&#x4E5F;&#x6709;&#x4E0D;&#x597D;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x90A3;&#x5C31; &#x662F;&#x9012;&#x5F52;&#x5B9A;&#x4E49;&#xFF0C;&#x5982;&#xFF1A;</p>
<pre><code>CFLAGS = $(CFLAGS) -O
</code></pre><p>&#x6216;&#xFF1A;</p>
<pre><code>A = $(B)B = $(A)
</code></pre><p>&#x8FD9;&#x4F1A;&#x8BA9;make&#x9677;&#x5165;&#x65E0;&#x9650;&#x7684;&#x53D8;&#x91CF;&#x5C55;&#x5F00;&#x8FC7;&#x7A0B;&#x4E2D;&#x53BB;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x6211;&#x4EEC;&#x7684;make&#x662F;&#x6709;&#x80FD;&#x529B;&#x68C0;&#x6D4B;&#x8FD9;&#x6837;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x5E76;&#x4F1A;&#x62A5;&#x9519;&#x3002;&#x8FD8;&#x6709;&#x5C31; &#x662F;&#x5982;&#x679C;&#x5728;&#x53D8;&#x91CF;&#x4E2D;&#x4F7F;&#x7528;&#x51FD;&#x6570;&#xFF0C;&#x90A3;&#x4E48;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x4F1A;&#x8BA9;&#x6211;&#x4EEC;&#x7684;make&#x8FD0;&#x884C;&#x65F6;&#x975E;&#x5E38;&#x6162;&#xFF0C;&#x66F4;&#x7CDF;&#x7CD5;&#x7684;&#x662F;&#xFF0C;&#x4ED6;&#x4F1A;&#x4F7F;&#x7528;&#x5F97;&#x4E24; &#x4E2A;make&#x7684;&#x51FD;&#x6570;&#x201C;wildcard&#x201D;&#x548C;&#x201C;shell&#x201D;&#x53D1;&#x751F;&#x4E0D;&#x53EF;&#x9884;&#x77E5;&#x7684;&#x9519;&#x8BEF;&#x3002;&#x56E0;&#x4E3A;&#x4F60;&#x4E0D;&#x4F1A;&#x77E5;&#x9053;&#x8FD9;&#x4E24;&#x4E2A;&#x51FD;&#x6570;&#x4F1A;&#x88AB;&#x8C03;&#x7528;&#x591A;&#x5C11;&#x6B21;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x4E0A;&#x9762;&#x7684;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;make&#x4E2D;&#x7684;&#x53E6;&#x4E00;&#x79CD;&#x7528;&#x53D8;&#x91CF;&#x6765;&#x5B9A;&#x4E49;&#x53D8;&#x91CF;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x4F7F;&#x7528;&#x7684;&#x662F; := &#x64CD;&#x4F5C;&#x7B26;&#xFF0C;&#x5982;&#xFF1A;</p>
<pre><code>x := foo
y := $(x) bar
x := later
</code></pre><p>&#x5176;&#x7B49;&#x4EF7;&#x4E8E;&#xFF1A;</p>
<pre><code>y := foo bar
x := later
</code></pre><p>&#x503C;&#x5F97;&#x4E00;&#x63D0;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x524D;&#x9762;&#x7684;&#x53D8;&#x91CF;&#x4E0D;&#x80FD;&#x4F7F;&#x7528;&#x540E;&#x9762;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x53EA;&#x80FD;&#x4F7F;&#x7528;&#x524D;&#x9762;&#x5DF2;&#x5B9A;&#x4E49;&#x597D;&#x4E86;&#x7684;&#x53D8;&#x91CF;&#x3002;&#x5982;&#x679C;&#x662F;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code>y := $(x) bar
x := foo
</code></pre><p>&#x90A3;&#x4E48;&#xFF0C;y&#x7684;&#x503C;&#x662F;&#x201C;bar&#x201D;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x201C;foo bar&#x201D;&#x3002;
&#x4E0A;&#x9762;&#x90FD;&#x662F;&#x4E00;&#x4E9B;&#x6BD4;&#x8F83;&#x7B80;&#x5355;&#x7684;&#x53D8;&#x91CF;&#x4F7F;&#x7528;&#x4E86;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E2A;&#x590D;&#x6742;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x62EC;&#x4E86;make&#x7684;&#x51FD;&#x6570;&#x3001;&#x6761;&#x4EF6;&#x8868;&#x8FBE;&#x5F0F;&#x548C; &#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x53D8;&#x91CF;&#x201C;MAKELEVEL&#x201D;&#x7684;&#x4F7F;&#x7528;&#xFF1A;</p>
<pre><code>ifeq (0,${MAKELEVEL})cur-dir := $(shell pwd)whoami := $(shell whoami)host-type := $(shell arch)MAKE := ${MAKE} host-type=${host-type} whoami=${whoami}endif
</code></pre><p>&#x5173;&#x4E8E;&#x6761;&#x4EF6;&#x8868;&#x8FBE;&#x5F0F;&#x548C;&#x51FD;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x540E;&#x9762;&#x518D;&#x8BF4;&#xFF0C;&#x5BF9;&#x4E8E;&#x7CFB;&#x7EDF;&#x53D8;&#x91CF;&#x201C;MAKELEVEL&#x201D;&#xFF0C;&#x5176;&#x610F;&#x601D;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x7684;make&#x6709;&#x4E00; &#x4E2A;&#x5D4C;&#x5957;&#x6267;&#x884C;&#x7684;&#x52A8;&#x4F5C;&#xFF08;&#x53C2;&#x89C1;&#x524D;&#x9762;&#x7684;&#x201C;&#x5D4C;&#x5957;&#x4F7F;&#x7528;make&#x201D;&#xFF09;&#xFF0C;&#x90A3;&#x4E48;&#xFF0C;&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#x4F1A;&#x8BB0;&#x5F55;&#x4E86;&#x6211;&#x4EEC;&#x7684;&#x5F53;&#x524D;Makefile&#x7684;&#x8C03;&#x7528; &#x5C42;&#x6570;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x518D;&#x4ECB;&#x7ECD;&#x4E24;&#x4E2A;&#x5B9A;&#x4E49;&#x53D8;&#x91CF;&#x65F6;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x77E5;&#x9053;&#x7684;&#xFF0C;&#x8BF7;&#x5148;&#x770B;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x8981;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#xFF0C;&#x5176;&#x503C;&#x662F;&#x4E00;&#x4E2A; &#x7A7A;&#x683C;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x6765;&#xFF1A;</p>
<pre><code>nullstring :=space := $(nullstring) # end of the line
</code></pre><p>nullstring&#x662F;&#x4E00;&#x4E2A;Empty&#x53D8;&#x91CF;&#xFF0C;&#x5176;&#x4E2D;&#x4EC0;&#x4E48;&#x4E5F;&#x6CA1;&#x6709;&#xFF0C;&#x800C;&#x6211;&#x4EEC;&#x7684;space&#x7684;&#x503C;&#x662F;&#x4E00;&#x4E2A;&#x7A7A;&#x683C;&#x3002;&#x56E0;&#x4E3A;&#x5728;&#x64CD;&#x4F5C;&#x7B26;&#x7684;&#x53F3;&#x8FB9; &#x662F;&#x5F88;&#x96BE;&#x63CF;&#x8FF0;&#x4E00;&#x4E2A;&#x7A7A;&#x683C;&#x7684;&#xFF0C;&#x8FD9;&#x91CC;&#x91C7;&#x7528;&#x7684;&#x6280;&#x672F;&#x5F88;&#x7BA1;&#x7528;&#xFF0C;&#x5148;&#x7528;&#x4E00;&#x4E2A;Empty&#x53D8;&#x91CF;&#x6765;&#x6807;&#x660E;&#x53D8;&#x91CF;&#x7684;&#x503C;&#x5F00;&#x59CB;&#x4E86;&#xFF0C;&#x800C;&#x540E;&#x9762;&#x91C7; &#x7528;&#x201C;#&#x201D;&#x6CE8;&#x91CA;&#x7B26;&#x6765;&#x8868;&#x793A;&#x53D8;&#x91CF;&#x5B9A;&#x4E49;&#x7684;&#x7EC8;&#x6B62;&#xFF0C;&#x8FD9;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x51FA;&#x5176;&#x503C;&#x662F;&#x4E00;&#x4E2A;&#x7A7A;&#x683C;&#x7684;&#x53D8;&#x91CF;&#x3002;&#x8BF7;&#x6CE8;&#x610F;&#x8FD9;&#x91CC;&#x5173;&#x4E8E;&#x201C;#&#x201D;&#x7684; &#x4F7F;&#x7528;&#xFF0C;&#x6CE8;&#x91CA;&#x7B26;&#x201C;#&#x201D;&#x7684;&#x8FD9;&#x79CD;&#x7279;&#x6027;&#x503C;&#x5F97;&#x6211;&#x4EEC;&#x6CE8;&#x610F;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x8FD9;&#x6837;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#xFF1A;</p>
<pre><code>dir := /foo/bar # directory to put the frobs in
</code></pre><p>dir&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#x7684;&#x503C;&#x662F;&#x201C;/foo/bar&#x201D;&#xFF0C;&#x540E;&#x9762;&#x8FD8;&#x8DDF;&#x4E86;4&#x4E2A;&#x7A7A;&#x683C;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x8FD9;&#x6837;&#x4F7F;&#x7528;&#x8FD9;&#x6837;&#x53D8;&#x91CF;&#x6765;&#x6307;&#x5B9A;&#x522B;&#x7684;&#x76EE; &#x5F55;&#x2014;&#x2014;&#x201C;$(dir)/file&#x201D;&#x90A3;&#x4E48;&#x5C31;&#x5B8C;&#x86CB;&#x4E86;&#x3002;</p>
<p>&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x6709;&#x7528;&#x7684;&#x64CD;&#x4F5C;&#x7B26;&#x662F; ?= &#xFF0C;&#x5148;&#x770B;&#x793A;&#x4F8B;&#xFF1A;</p>
<pre><code>FOO ?= bar
</code></pre><p>&#x5176;&#x542B;&#x4E49;&#x662F;&#xFF0C;&#x5982;&#x679C;FOO&#x6CA1;&#x6709;&#x88AB;&#x5B9A;&#x4E49;&#x8FC7;&#xFF0C;&#x90A3;&#x4E48;&#x53D8;&#x91CF;FOO&#x7684;&#x503C;&#x5C31;&#x662F;&#x201C;bar&#x201D;&#xFF0C;&#x5982;&#x679C;FOO&#x5148;&#x524D;&#x88AB;&#x5B9A;&#x4E49;&#x8FC7;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x6761;&#x8BED;&#x5C06; &#x4EC0;&#x4E48;&#x4E5F;&#x4E0D;&#x505A;&#xFF0C;&#x5176;&#x7B49;&#x4EF7;&#x4E8E;&#xFF1A;</p>
<pre><code>ifeq ($(origin FOO), undefined)
FOO = bar
endif
</code></pre><h1 id="&#x53D8;&#x91CF;&#x9AD8;&#x7EA7;&#x7528;&#x6CD5;">&#x53D8;&#x91CF;&#x9AD8;&#x7EA7;&#x7528;&#x6CD5;</h1>
<p>&#x8FD9;&#x91CC;&#x4ECB;&#x7ECD;&#x4E24;&#x79CD;&#x53D8;&#x91CF;&#x7684;&#x9AD8;&#x7EA7;&#x4F7F;&#x7528;&#x65B9;&#x6CD5;&#xFF0C;&#x7B2C;&#x4E00;&#x79CD;&#x662F;&#x53D8;&#x91CF;&#x503C;&#x7684;&#x66FF;&#x6362;&#x3002;
&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x66FF;&#x6362;&#x53D8;&#x91CF;&#x4E2D;&#x7684;&#x5171;&#x6709;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x5176;&#x683C;&#x5F0F;&#x662F; $(var:a=b) &#x6216;&#x662F; ${var:a=b} &#xFF0C;&#x5176;&#x610F;&#x601D;&#x662F;&#xFF0C; &#x628A;&#x53D8;&#x91CF;&#x201C;var&#x201D;&#x4E2D;&#x6240;&#x6709;&#x4EE5;&#x201C;a&#x201D;&#x5B57;&#x4E32;&#x201C;&#x7ED3;&#x5C3E;&#x201D;&#x7684;&#x201C;a&#x201D;&#x66FF;&#x6362;&#x6210;&#x201C;b&#x201D;&#x5B57;&#x4E32;&#x3002;&#x8FD9;&#x91CC;&#x7684;&#x201C;&#x7ED3;&#x5C3E;&#x201D;&#x610F;&#x601D;&#x662F;&#x201C;&#x7A7A;&#x683C;&#x201D;&#x6216;&#x662F;&#x201C;&#x7ED3;&#x675F;&#x7B26;&#x201D;&#x3002;</p>
<p>&#x8FD8;&#x662F;&#x770B;&#x4E00;&#x4E2A;&#x793A;&#x4F8B;&#x5427;&#xFF1A;</p>
<pre><code>foo := a.o b.o c.o
bar := $(foo:.o=.c)
</code></pre><p>&#x8FD9;&#x4E2A;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5148;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A; $(foo) &#x53D8;&#x91CF;&#xFF0C;&#x800C;&#x7B2C;&#x4E8C;&#x884C;&#x7684;&#x610F;&#x601D;&#x662F;&#x628A; $(foo) &#x4E2D;&#x6240;&#x6709;&#x4EE5; .o &#x5B57;&#x4E32;&#x201C;&#x7ED3;&#x5C3E;&#x201D;&#x5168;&#x90E8;&#x66FF;&#x6362;&#x6210; .c &#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x7684; $(bar) &#x7684;&#x503C;&#x5C31;&#x662F;&#x201C;a.c b.c c.c&#x201D;&#x3002;</p>
<p>&#x53E6;&#x5916;&#x4E00;&#x79CD;&#x53D8;&#x91CF;&#x66FF;&#x6362;&#x7684;&#x6280;&#x672F;&#x662F;&#x4EE5;&#x201C;&#x9759;&#x6001;&#x6A21;&#x5F0F;&#x201D;&#xFF08;&#x53C2;&#x89C1;&#x524D;&#x9762;&#x7AE0;&#x8282;&#xFF09;&#x5B9A;&#x4E49;&#x7684;&#xFF0C;&#x5982;&#xFF1A;</p>
<pre><code>foo := a.o b.o c.o
bar := $(foo:%.o=%.c)
</code></pre><p>&#x8FD9;&#x4F9D;&#x8D56;&#x4E8E;&#x88AB;&#x66FF;&#x6362;&#x5B57;&#x4E32;&#x4E2D;&#x7684;&#x6709;&#x76F8;&#x540C;&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x6A21;&#x5F0F;&#x4E2D;&#x5FC5;&#x987B;&#x5305;&#x542B;&#x4E00;&#x4E2A; % &#x5B57;&#x7B26;&#xFF0C;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x540C;&#x6837;&#x8BA9; $(bar) &#x53D8;&#x91CF;&#x7684;&#x503C;&#x4E3A;&#x201C;a.c b.c c.c&#x201D;&#x3002;
&#x7B2C;&#x4E8C;&#x79CD;&#x9AD8;&#x7EA7;&#x7528;&#x6CD5;&#x662F;&#x2014;&#x2014;&#x201C;&#x628A;&#x53D8;&#x91CF;&#x7684;&#x503C;&#x518D;&#x5F53;&#x6210;&#x53D8;&#x91CF;&#x201D;&#x3002;&#x5148;&#x770B;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code>x = y
y = z
a := $($(x))
</code></pre><p>&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;$(x)&#x7684;&#x503C;&#x662F;&#x201C;y&#x201D;&#xFF0C;&#x6240;&#x4EE5;$($(x))&#x5C31;&#x662F;$(y)&#xFF0C;&#x4E8E;&#x662F;$(a)&#x7684;&#x503C;&#x5C31;&#x662F;&#x201C;z&#x201D;&#x3002;&#xFF08;&#x6CE8;&#x610F;&#xFF0C;&#x662F;&#x201C;x=y&#x201D;&#xFF0C; &#x800C;&#x4E0D;&#x662F;&#x201C;x=$(y)&#x201D;&#xFF09;
&#x6211;&#x4EEC;&#x8FD8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x66F4;&#x591A;&#x7684;&#x5C42;&#x6B21;&#xFF1A;</p>
<pre><code>x = y
y = z
z = u
a := $($($(x)))
</code></pre><p>&#x8FD9;&#x91CC;&#x7684; $(a) &#x7684;&#x503C;&#x662F;&#x201C;u&#x201D;&#xFF0C;&#x76F8;&#x5173;&#x7684;&#x63A8;&#x5BFC;&#x7559;&#x7ED9;&#x8BFB;&#x8005;&#x81EA;&#x5DF1;&#x53BB;&#x505A;&#x5427;&#x3002;
&#x8BA9;&#x6211;&#x4EEC;&#x518D;&#x590D;&#x6742;&#x4E00;&#x70B9;&#xFF0C;&#x4F7F;&#x7528;&#x4E0A;&#x201C;&#x5728;&#x53D8;&#x91CF;&#x5B9A;&#x4E49;&#x4E2D;&#x4F7F;&#x7528;&#x53D8;&#x91CF;&#x201D;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x65B9;&#x5F0F;&#xFF0C;&#x6765;&#x770B;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code>x = $(y)y = z
z = Hello
a := $($(x))
</code></pre><p>&#x8FD9;&#x91CC;&#x7684; $($(x)) &#x88AB;&#x66FF;&#x6362;&#x6210;&#x4E86; $($(y)) &#xFF0C;&#x56E0;&#x4E3A; $(y) &#x503C;&#x662F;&#x201C;z&#x201D;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x6700;&#x7EC8;&#x7ED3;&#x679C;&#x662F;&#xFF1A; a:=$(z) &#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x201C;Hello&#x201D;&#x3002;
&#x518D;&#x590D;&#x6742;&#x4E00;&#x70B9;&#xFF0C;&#x6211;&#x4EEC;&#x518D;&#x52A0;&#x4E0A;&#x51FD;&#x6570;&#xFF1A;</p>
<pre><code>x = variable1
variable2 := Hello
y = $(subst 1,2,$(x))z = y
a := $($($(z)))
</code></pre><p>&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C; $($($(z))) &#x6269;&#x5C55;&#x4E3A; $($(y)) &#xFF0C;&#x800C;&#x5176;&#x518D;&#x6B21;&#x88AB;&#x6269;&#x5C55;&#x4E3A; $($(subst 1,2,$(x))) &#x3002; $(x) &#x7684;&#x503C;&#x662F;&#x201C;variable1&#x201D;&#xFF0C;subst&#x51FD;&#x6570;&#x628A;&#x201C;variable1&#x201D;&#x4E2D;&#x7684; &#x6240;&#x6709;&#x201C;1&#x201D;&#x5B57;&#x4E32;&#x66FF;&#x6362;&#x6210;&#x201C;2&#x201D;&#x5B57;&#x4E32;&#xFF0C;&#x4E8E;&#x662F;&#xFF0C;&#x201C;variable1&#x201D;&#x53D8;&#x6210; &#x201C;variable2&#x201D;&#xFF0C;&#x518D;&#x53D6;&#x5176;&#x503C;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x6700;&#x7EC8;&#xFF0C; $(a) &#x7684;&#x503C;&#x5C31;&#x662F; $(variable2) &#x7684;&#x503C;&#x2014;&#x2014;&#x201C;Hello&#x201D;&#x3002;&#xFF08;&#x5594;&#xFF0C;&#x597D;&#x4E0D;&#x5BB9;&#x6613;&#xFF09;</p>
<p>&#x5728;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x4E2D;&#xFF0C;&#x6216;&#x8981;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x591A;&#x4E2A;&#x53D8;&#x91CF;&#x6765;&#x7EC4;&#x6210;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x7684;&#x540D;&#x5B57;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x53D6;&#x5176;&#x503C;&#xFF1A;</p>
<pre><code>first_second = Hello
a = first
b = second
all = $($a_$b)
</code></pre><p>&#x8FD9;&#x91CC;&#x7684; $a_$b &#x7EC4;&#x6210;&#x4E86;&#x201C;first_second&#x201D;&#xFF0C;&#x4E8E;&#x662F;&#xFF0C; $(all) &#x7684;&#x503C;&#x5C31;&#x662F;&#x201C;Hello&#x201D;&#x3002;
&#x518D;&#x6765;&#x770B;&#x770B;&#x7ED3;&#x5408;&#x7B2C;&#x4E00;&#x79CD;&#x6280;&#x672F;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code>a_objects := a.o b.o c.o
1_objects := 1.o 2.o 3.o

sources := $($(a1)_objects:.o=.c)
</code></pre><p>&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x5982;&#x679C; $(a1) &#x7684;&#x503C;&#x662F;&#x201C;a&#x201D;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4E48;&#xFF0C; $(sources) &#x7684;&#x503C;&#x5C31;&#x662F;&#x201C;a.c b.c c.c&#x201D;&#xFF1B; &#x5982;&#x679C; $(a1) &#x7684;&#x503C;&#x662F;&#x201C;1&#x201D;&#xFF0C;&#x90A3;&#x4E48; $(sources) &#x7684;&#x503C;&#x662F;&#x201C;1.c 2.c 3.c&#x201D;&#x3002;</p>
<p>&#x518D;&#x6765;&#x770B;&#x4E00;&#x4E2A;&#x8FD9;&#x79CD;&#x6280;&#x672F;&#x548C;&#x201C;&#x51FD;&#x6570;&#x201D;&#x4E0E;&#x201C;&#x6761;&#x4EF6;&#x8BED;&#x53E5;&#x201D;&#x4E00;&#x540C;&#x4F7F;&#x7528;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code>ifdef do_sort
func := sort
else
func := strip
endif

bar := a d b g q c

foo := $($(func) $(bar))
</code></pre><p>&#x8FD9;&#x4E2A;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x5B9A;&#x4E49;&#x4E86;&#x201C;do_sort&#x201D;&#xFF0C;&#x90A3;&#x4E48;&#xFF1A; foo := $(sort a d b g q c) &#xFF0C;&#x4E8E;&#x662F; $(foo) &#x7684;&#x503C;&#x5C31;&#x662F; &#x201C;a b c d g q&#x201D;&#xFF0C;&#x800C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x5B9A;&#x4E49;&#x201C;do_sort&#x201D;&#xFF0C;&#x90A3;&#x4E48;&#xFF1A; foo := $(strip a d b g q c) &#xFF0C;&#x8C03;&#x7528;&#x7684;&#x5C31;&#x662F;strip&#x51FD;&#x6570;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x201C;&#x628A;&#x53D8;&#x91CF;&#x7684;&#x503C;&#x518D;&#x5F53;&#x6210;&#x53D8;&#x91CF;&#x201D;&#x8FD9;&#x79CD;&#x6280;&#x672F;&#xFF0C;&#x540C;&#x6837;&#x53EF;&#x4EE5;&#x7528;&#x5728;&#x64CD;&#x4F5C;&#x7B26;&#x7684;&#x5DE6;&#x8FB9;:</p>
<pre><code>dir = foo
$(dir)_sources := $(wildcard $(dir)/*.c)
define $(dir)_print
lpr $($(dir)_sources)
endef
</code></pre><p>&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#x5B9A;&#x4E49;&#x4E86;&#x4E09;&#x4E2A;&#x53D8;&#x91CF;&#xFF1A;&#x201C;dir&#x201D;&#xFF0C;&#x201C;foo_sources&#x201D;&#x548C;&#x201C;foo_print&#x201D;&#x3002;</p>
<h1 id="&#x8FFD;&#x52A0;&#x53D8;&#x91CF;&#x503C;">&#x8FFD;&#x52A0;&#x53D8;&#x91CF;&#x503C;</h1>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; += &#x64CD;&#x4F5C;&#x7B26;&#x7ED9;&#x53D8;&#x91CF;&#x8FFD;&#x52A0;&#x503C;&#xFF0C;&#x5982;&#xFF1A;</p>
<pre><code>objects = main.o foo.o bar.o utils.o
objects += another.o
</code></pre><p>&#x4E8E;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x7684; $(objects) &#x503C;&#x53D8;&#x6210;&#xFF1A;&#x201C;main.o foo.o bar.o utils.o another.o&#x201D;&#xFF08;another.o&#x88AB;&#x8FFD;&#x52A0;&#x8FDB;&#x53BB;&#x4E86;&#xFF09;
&#x4F7F;&#x7528; += &#x64CD;&#x4F5C;&#x7B26;&#xFF0C;&#x53EF;&#x4EE5;&#x6A21;&#x62DF;&#x4E3A;&#x4E0B;&#x9762;&#x7684;&#x8FD9;&#x79CD;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code>objects = main.o foo.o bar.o utils.o
objects := $(objects) another.o
</code></pre><p>&#x6240;&#x4E0D;&#x540C;&#x7684;&#x662F;&#xFF0C;&#x7528; += &#x66F4;&#x4E3A;&#x7B80;&#x6D01;&#x3002;
&#x5982;&#x679C;&#x53D8;&#x91CF;&#x4E4B;&#x524D;&#x6CA1;&#x6709;&#x5B9A;&#x4E49;&#x8FC7;&#xFF0C;&#x90A3;&#x4E48;&#xFF0C; += &#x4F1A;&#x81EA;&#x52A8;&#x53D8;&#x6210; = &#xFF0C;&#x5982;&#x679C;&#x524D;&#x9762;&#x6709;&#x53D8;&#x91CF;&#x5B9A;&#x4E49;&#xFF0C;&#x90A3;&#x4E48; += &#x4F1A; &#x7EE7;&#x627F;&#x4E8E;&#x524D;&#x6B21;&#x64CD;&#x4F5C;&#x7684;&#x8D4B;&#x503C;&#x7B26;&#x3002;&#x5982;&#x679C;&#x524D;&#x4E00;&#x6B21;&#x7684;&#x662F; := &#xFF0C;&#x90A3;&#x4E48; += &#x4F1A;&#x4EE5; := &#x4F5C;&#x4E3A;&#x5176;&#x8D4B;&#x503C;&#x7B26;&#xFF0C;&#x5982;&#xFF1A;</p>
<pre><code>variable := value
variable += more
</code></pre><p>&#x7B49;&#x4EF7;&#x4E8E;&#xFF1A;</p>
<pre><code>variable := value
variable := $(variable) more
</code></pre><p>&#x4F46;&#x5982;&#x679C;&#x662F;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF1A;</p>
<pre><code>variable = value
variable += more
</code></pre><p>&#x7531;&#x4E8E;&#x524D;&#x6B21;&#x7684;&#x8D4B;&#x503C;&#x7B26;&#x662F; = &#xFF0C;&#x6240;&#x4EE5; += &#x4E5F;&#x4F1A;&#x4EE5; = &#x6765;&#x505A;&#x4E3A;&#x8D4B;&#x503C;&#xFF0C;&#x90A3;&#x4E48;&#x5C82;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#x53D8;&#x91CF;&#x7684;&#x9012;&#x8865;&#x5F52; &#x5B9A;&#x4E49;&#xFF0C;&#x8FD9;&#x662F;&#x5F88;&#x4E0D;&#x597D;&#x7684;&#xFF0C;&#x6240;&#x4EE5;make&#x4F1A;&#x81EA;&#x52A8;&#x4E3A;&#x6211;&#x4EEC;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x5FC5;&#x62C5;&#x5FC3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p>
<h1 id="override-&#x6307;&#x793A;&#x7B26;">override &#x6307;&#x793A;&#x7B26;</h1>
<p>&#x5982;&#x679C;&#x6709;&#x53D8;&#x91CF;&#x662F;&#x901A;&#x5E38;make&#x7684;&#x547D;&#x4EE4;&#x884C;&#x53C2;&#x6570;&#x8BBE;&#x7F6E;&#x7684;&#xFF0C;&#x90A3;&#x4E48;Makefile&#x4E2D;&#x5BF9;&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#x7684;&#x8D4B;&#x503C;&#x4F1A;&#x88AB;&#x5FFD;&#x7565;&#x3002;&#x5982;&#x679C;&#x4F60;&#x60F3; &#x5728;Makefile&#x4E2D;&#x8BBE;&#x7F6E;&#x8FD9;&#x7C7B;&#x53C2;&#x6570;&#x7684;&#x503C;&#xFF0C;&#x90A3;&#x4E48;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x201C;override&#x201D;&#x6307;&#x793A;&#x7B26;&#x3002;&#x5176;&#x8BED;&#x6CD5;&#x662F;:</p>
<pre><code>override &lt;variable&gt;; = &lt;value&gt;;

override &lt;variable&gt;; := &lt;value&gt;;
</code></pre><p>&#x5F53;&#x7136;&#xFF0C;&#x4F60;&#x8FD8;&#x53EF;&#x4EE5;&#x8FFD;&#x52A0;:</p>
<pre><code>override &lt;variable&gt;; += &lt;more text&gt;;
</code></pre><p>&#x5BF9;&#x4E8E;&#x591A;&#x884C;&#x7684;&#x53D8;&#x91CF;&#x5B9A;&#x4E49;&#xFF0C;&#x6211;&#x4EEC;&#x7528;define&#x6307;&#x793A;&#x7B26;&#xFF0C;&#x5728;define&#x6307;&#x793A;&#x7B26;&#x524D;&#xFF0C;&#x4E5F;&#x540C;&#x6837;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;override&#x6307;&#x793A;&#x7B26;&#xFF0C; &#x5982;:</p>
<pre><code>override define foobarendef
</code></pre><h1 id="&#x591A;&#x884C;&#x53D8;&#x91CF;">&#x591A;&#x884C;&#x53D8;&#x91CF;</h1>
<p>&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#x8BBE;&#x7F6E;&#x53D8;&#x91CF;&#x503C;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x4F7F;&#x7528;define&#x5173;&#x952E;&#x5B57;&#x3002;&#x4F7F;&#x7528;define&#x5173;&#x952E;&#x5B57;&#x8BBE;&#x7F6E;&#x53D8;&#x91CF;&#x7684;&#x503C;&#x53EF;&#x4EE5;&#x6709;&#x6362;&#x884C;&#xFF0C;&#x8FD9;&#x6709;&#x5229;&#x4E8E; &#x5B9A;&#x4E49;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x547D;&#x4EE4;&#xFF08;&#x524D;&#x9762;&#x6211;&#x4EEC;&#x8BB2;&#x8FC7;&#x201C;&#x547D;&#x4EE4;&#x5305;&#x201D;&#x7684;&#x6280;&#x672F;&#x5C31;&#x662F;&#x5229;&#x7528;&#x8FD9;&#x4E2A;&#x5173;&#x952E;&#x5B57;&#xFF09;&#x3002;</p>
<p>define&#x6307;&#x793A;&#x7B26;&#x540E;&#x9762;&#x8DDF;&#x7684;&#x662F;&#x53D8;&#x91CF;&#x7684;&#x540D;&#x5B57;&#xFF0C;&#x800C;&#x91CD;&#x8D77;&#x4E00;&#x884C;&#x5B9A;&#x4E49;&#x53D8;&#x91CF;&#x7684;&#x503C;&#xFF0C;&#x5B9A;&#x4E49;&#x662F;&#x4EE5;endef &#x5173;&#x952E;&#x5B57;&#x7ED3;&#x675F;&#x3002;&#x5176;&#x5DE5;&#x4F5C;&#x65B9; &#x5F0F;&#x548C;&#x201C;=&#x201D;&#x64CD;&#x4F5C;&#x7B26;&#x4E00;&#x6837;&#x3002;&#x53D8;&#x91CF;&#x7684;&#x503C;&#x53EF;&#x4EE5;&#x5305;&#x542B;&#x51FD;&#x6570;&#x3001;&#x547D;&#x4EE4;&#x3001;&#x6587;&#x5B57;&#xFF0C;&#x6216;&#x662F;&#x5176;&#x5B83;&#x53D8;&#x91CF;&#x3002;&#x56E0;&#x4E3A;&#x547D;&#x4EE4;&#x9700;&#x8981;&#x4EE5;[Tab]&#x952E;&#x5F00;&#x5934;&#xFF0C; &#x6240;&#x4EE5;&#x5982;&#x679C;&#x4F60;&#x7528;define&#x5B9A;&#x4E49;&#x7684;&#x547D;&#x4EE4;&#x53D8;&#x91CF;&#x4E2D;&#x6CA1;&#x6709;&#x4EE5; Tab &#x952E;&#x5F00;&#x5934;&#xFF0C;&#x90A3;&#x4E48;make &#x5C31;&#x4E0D;&#x4F1A;&#x628A;&#x5176;&#x8BA4;&#x4E3A;&#x662F;&#x547D;&#x4EE4;&#x3002;
&#x4E0B;&#x9762;&#x7684;&#x8FD9;&#x4E2A;&#x793A;&#x4F8B;&#x5C55;&#x793A;&#x4E86;define&#x7684;&#x7528;&#x6CD5;:</p>
<pre><code>define two-lines
echo foo
echo $(bar)
endef
</code></pre><h1 id="&#x73AF;&#x5883;&#x53D8;&#x91CF;">&#x73AF;&#x5883;&#x53D8;&#x91CF;</h1>
<p>make&#x8FD0;&#x884C;&#x65F6;&#x7684;&#x7CFB;&#x7EDF;&#x73AF;&#x5883;&#x53D8;&#x91CF;&#x53EF;&#x4EE5;&#x5728;make&#x5F00;&#x59CB;&#x8FD0;&#x884C;&#x65F6;&#x88AB;&#x8F7D;&#x5165;&#x5230;Makefile&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;Makefile&#x4E2D;&#x5DF2; &#x5B9A;&#x4E49;&#x4E86;&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#xFF0C;&#x6216;&#x662F;&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#x7531;make&#x547D;&#x4EE4;&#x884C;&#x5E26;&#x5165;&#xFF0C;&#x90A3;&#x4E48;&#x7CFB;&#x7EDF;&#x7684;&#x73AF;&#x5883;&#x53D8;&#x91CF;&#x7684;&#x503C;&#x5C06;&#x88AB;&#x8986;&#x76D6;&#x3002;&#xFF08;&#x5982;&#x679C;make&#x6307;&#x5B9A; &#x4E86;&#x201C;-e&#x201D;&#x53C2;&#x6570;&#xFF0C;&#x90A3;&#x4E48;&#xFF0C;&#x7CFB;&#x7EDF;&#x73AF;&#x5883;&#x53D8;&#x91CF;&#x5C06;&#x8986;&#x76D6;Makefile&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x53D8;&#x91CF;&#xFF09;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5728;&#x73AF;&#x5883;&#x53D8;&#x91CF;&#x4E2D;&#x8BBE;&#x7F6E;&#x4E86; CFLAGS &#x73AF;&#x5883;&#x53D8;&#x91CF;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x6240;&#x6709;&#x7684;Makefile&#x4E2D;&#x4F7F;&#x7528; &#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#x4E86;&#x3002;&#x8FD9;&#x5BF9;&#x4E8E;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x7EDF;&#x4E00;&#x7684;&#x7F16;&#x8BD1;&#x53C2;&#x6570;&#x6709;&#x6BD4;&#x8F83;&#x5927;&#x7684;&#x597D;&#x5904;&#x3002;&#x5982;&#x679C;Makefile&#x4E2D;&#x5B9A;&#x4E49;&#x4E86;CFLAGS&#xFF0C;&#x90A3;&#x4E48;&#x5219;&#x4F1A; &#x4F7F;&#x7528;Makefile&#x4E2D;&#x7684;&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x5B9A;&#x4E49;&#x5219;&#x4F7F;&#x7528;&#x7CFB;&#x7EDF;&#x73AF;&#x5883;&#x53D8;&#x91CF;&#x7684;&#x503C;&#xFF0C;&#x4E00;&#x4E2A;&#x5171;&#x6027;&#x548C;&#x4E2A;&#x6027;&#x7684;&#x7EDF;&#x4E00;&#xFF0C;&#x5F88;&#x50CF;&#x201C;&#x5168;&#x5C40; &#x53D8;&#x91CF;&#x201D;&#x548C;&#x201C;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x201D;&#x7684;&#x7279;&#x6027;&#x3002;</p>
<p>&#x5F53;make&#x5D4C;&#x5957;&#x8C03;&#x7528;&#x65F6;&#xFF08;&#x53C2;&#x89C1;&#x524D;&#x9762;&#x7684;&#x201C;&#x5D4C;&#x5957;&#x8C03;&#x7528;&#x201D;&#x7AE0;&#x8282;&#xFF09;&#xFF0C;&#x4E0A;&#x5C42;Makefile&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x53D8;&#x91CF;&#x4F1A;&#x4EE5;&#x7CFB;&#x7EDF;&#x73AF;&#x5883;&#x53D8;&#x91CF;&#x7684;&#x65B9;&#x5F0F; &#x4F20;&#x9012;&#x5230;&#x4E0B;&#x5C42;&#x7684;Makefile &#x4E2D;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53EA;&#x6709;&#x901A;&#x8FC7;&#x547D;&#x4EE4;&#x884C;&#x8BBE;&#x7F6E;&#x7684;&#x53D8;&#x91CF;&#x4F1A;&#x88AB;&#x4F20;&#x9012;&#x3002;&#x800C;&#x5B9A;&#x4E49;&#x5728;&#x6587;&#x4EF6;&#x4E2D;&#x7684; &#x53D8;&#x91CF;&#xFF0C;&#x5982;&#x679C;&#x8981;&#x5411;&#x4E0B;&#x5C42;Makefile&#x4F20;&#x9012;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x4F7F;&#x7528;exprot&#x5173;&#x952E;&#x5B57;&#x6765;&#x58F0;&#x660E;&#x3002;&#xFF08;&#x53C2;&#x89C1;&#x524D;&#x9762;&#x7AE0;&#x8282;&#xFF09;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x6211;&#x5E76;&#x4E0D;&#x63A8;&#x8350;&#x628A;&#x8BB8;&#x591A;&#x7684;&#x53D8;&#x91CF;&#x90FD;&#x5B9A;&#x4E49;&#x5728;&#x7CFB;&#x7EDF;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x8FD9;&#x6837;&#xFF0C;&#x5728;&#x6211;&#x4EEC;&#x6267;&#x884C;&#x4E0D;&#x7528;&#x7684;Makefile&#x65F6;&#xFF0C;&#x62E5;&#x6709;&#x7684;&#x662F;&#x540C;&#x4E00; &#x5957;&#x7CFB;&#x7EDF;&#x53D8;&#x91CF;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x4F1A;&#x5E26;&#x6765;&#x66F4;&#x591A;&#x7684;&#x9EBB;&#x70E6;&#x3002;</p>
<h1 id="&#x76EE;&#x6807;&#x53D8;&#x91CF;">&#x76EE;&#x6807;&#x53D8;&#x91CF;</h1>
<p>&#x524D;&#x9762;&#x6211;&#x4EEC;&#x6240;&#x8BB2;&#x7684;&#x5728;Makefile&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x53D8;&#x91CF;&#x90FD;&#x662F;&#x201C;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x201D;&#xFF0C;&#x5728;&#x6574;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x8FD9;&#x4E9B;&#x53D8;&#x91CF;&#x3002; &#x5F53;&#x7136;&#xFF0C;&#x201C;&#x81EA;&#x52A8;&#x5316;&#x53D8;&#x91CF;&#x201D;&#x9664;&#x5916;&#xFF0C;&#x5982; $&lt; &#x7B49;&#x8FD9;&#x79CD;&#x7C7B;&#x91CF;&#x7684;&#x81EA;&#x52A8;&#x5316;&#x53D8;&#x91CF;&#x5C31;&#x5C5E;&#x4E8E;&#x201C;&#x89C4;&#x5219;&#x578B;&#x53D8;&#x91CF;&#x201D;&#xFF0C;&#x8FD9;&#x79CD;&#x53D8;&#x91CF;&#x7684;&#x503C;&#x4F9D;&#x8D56; &#x4E8E;&#x89C4;&#x5219;&#x7684;&#x76EE;&#x6807;&#x548C;&#x4F9D;&#x8D56;&#x76EE;&#x6807;&#x7684;&#x5B9A;&#x4E49;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x6211;&#x4E5F;&#x540C;&#x6837;&#x53EF;&#x4EE5;&#x4E3A;&#x67D0;&#x4E2A;&#x76EE;&#x6807;&#x8BBE;&#x7F6E;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#xFF0C;&#x8FD9;&#x79CD;&#x53D8;&#x91CF;&#x88AB;&#x79F0;&#x4E3A;&#x201C;Target-specific Variable&#x201D;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5; &#x548C;&#x201C;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x201D;&#x540C;&#x540D;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x7684;&#x4F5C;&#x7528;&#x8303;&#x56F4;&#x53EA;&#x5728;&#x8FD9;&#x6761;&#x89C4;&#x5219;&#x4EE5;&#x53CA;&#x8FDE;&#x5E26;&#x89C4;&#x5219;&#x4E2D;&#xFF0C;&#x6240;&#x4EE5;&#x5176;&#x503C;&#x4E5F;&#x53EA;&#x5728;&#x4F5C;&#x7528;&#x8303;&#x56F4;&#x5185;&#x6709;&#x6548;&#x3002;&#x800C; &#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x89C4;&#x5219;&#x94FE;&#x4EE5;&#x5916;&#x7684;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x7684;&#x503C;&#x3002;
&#x5176;&#x8BED;&#x6CD5;&#x662F;&#xFF1A;</p>
<pre><code>&lt;target ...&gt; : &lt;variable-assignment&gt;;

&lt;target ...&gt; : overide &lt;variable-assignment&gt;
</code></pre><p><variable-assignment>;&#x53EF;&#x4EE5;&#x662F;&#x524D;&#x9762;&#x8BB2;&#x8FC7;&#x7684;&#x5404;&#x79CD;&#x8D4B;&#x503C;&#x8868;&#x8FBE;&#x5F0F;&#xFF0C;&#x5982; = &#x3001; := &#x3001; += <code>&#x6216;&#x662F;</code>?= &#x3002;&#x7B2C;&#x4E8C;&#x4E2A;&#x8BED;&#x6CD5;&#x662F;&#x9488;&#x5BF9;&#x4E8E;make&#x547D;&#x4EE4;&#x884C;&#x5E26;&#x5165;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x6216;&#x662F;&#x7CFB;&#x7EDF;&#x73AF;&#x5883;&#x53D8;&#x91CF;&#x3002;</variable-assignment></p>
<p>&#x8FD9;&#x4E2A;&#x7279;&#x6027;&#x975E;&#x5E38;&#x7684;&#x6709;&#x7528;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x8BBE;&#x7F6E;&#x4E86;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#xFF0C;&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#x4F1A;&#x4F5C;&#x7528;&#x5230;&#x7531;&#x8FD9;&#x4E2A;&#x76EE;&#x6807;&#x6240;&#x5F15;&#x53D1;&#x7684;&#x6240;&#x6709;&#x7684;&#x89C4;&#x5219;&#x4E2D; &#x53BB;&#x3002;&#x5982;&#xFF1A;</p>
<pre><code>prog : CFLAGS = -gprog : prog.o foo.o bar.o
$(CC) $(CFLAGS) prog.o foo.o bar.o

prog.o : prog.c
$(CC) $(CFLAGS) prog.c

foo.o : foo.c
$(CC) $(CFLAGS) foo.c

bar.o : bar.c
$(CC) $(CFLAGS) bar.c
</code></pre><p>&#x5728;&#x8FD9;&#x4E2A;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;&#x4E0D;&#x7BA1;&#x5168;&#x5C40;&#x7684; $(CFLAGS) &#x7684;&#x503C;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x5728;prog&#x76EE;&#x6807;&#xFF0C;&#x4EE5;&#x53CA;&#x5176;&#x6240;&#x5F15;&#x53D1;&#x7684;&#x6240;&#x6709;&#x89C4;&#x5219; &#x4E2D;&#xFF08;prog.o foo.o bar.o&#x7684;&#x89C4;&#x5219;&#xFF09;&#xFF0C; $(CFLAGS) &#x7684;&#x503C;&#x90FD;&#x662F; -g</p>
<h1 id="&#x6A21;&#x5F0F;&#x53D8;&#x91CF;">&#x6A21;&#x5F0F;&#x53D8;&#x91CF;</h1>
<p>&#x5728;GNU&#x7684;make&#x4E2D;&#xFF0C;&#x8FD8;&#x652F;&#x6301;&#x6A21;&#x5F0F;&#x53D8;&#x91CF;&#xFF08;Pattern-specific Variable&#xFF09;&#xFF0C;&#x901A;&#x8FC7;&#x4E0A;&#x9762;&#x7684;&#x76EE;&#x6807;&#x53D8;&#x91CF;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC; &#x77E5;&#x9053;&#xFF0C;&#x53D8;&#x91CF;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x5728;&#x67D0;&#x4E2A;&#x76EE;&#x6807;&#x4E0A;&#x3002;&#x6A21;&#x5F0F;&#x53D8;&#x91CF;&#x7684;&#x597D;&#x5904;&#x5C31;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7ED9;&#x5B9A;&#x4E00;&#x79CD;&#x201C;&#x6A21;&#x5F0F;&#x201D;&#xFF0C;&#x53EF;&#x4EE5;&#x628A;&#x53D8;&#x91CF;&#x5B9A;&#x4E49;&#x5728;&#x7B26; &#x5408;&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#x7684;&#x6240;&#x6709;&#x76EE;&#x6807;&#x4E0A;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x77E5;&#x9053;&#xFF0C;make&#x7684;&#x201C;&#x6A21;&#x5F0F;&#x201D;&#x4E00;&#x822C;&#x662F;&#x81F3;&#x5C11;&#x542B;&#x6709;&#x4E00;&#x4E2A; % &#x7684;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4EE5;&#x5982;&#x4E0B;&#x65B9;&#x5F0F;&#x7ED9;&#x6240;&#x6709;&#x4EE5; .o &#x7ED3;&#x5C3E;&#x7684;&#x76EE;&#x6807;&#x5B9A;&#x4E49;&#x76EE;&#x6807;&#x53D8;&#x91CF;&#xFF1A;</p>
<pre><code>%.o : CFLAGS = -O
</code></pre><p>&#x540C;&#x6837;&#xFF0C;&#x6A21;&#x5F0F;&#x53D8;&#x91CF;&#x7684;&#x8BED;&#x6CD5;&#x548C;&#x201C;&#x76EE;&#x6807;&#x53D8;&#x91CF;&#x201D;&#x4E00;&#x6837;&#xFF1A;</p>
<pre><code>&lt;pattern ...&gt;; : &lt;variable-assignment&gt;;

&lt;pattern ...&gt;; : override &lt;variable-assignment&gt;;
</code></pre><p>override&#x540C;&#x6837;&#x662F;&#x9488;&#x5BF9;&#x4E8E;&#x7CFB;&#x7EDF;&#x73AF;&#x5883;&#x4F20;&#x5165;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x6216;&#x662F;make&#x547D;&#x4EE4;&#x884C;&#x6307;&#x5B9A;&#x7684;&#x53D8;&#x91CF;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../chapter1/section2.html" class="navigation navigation-prev " aria-label="Previous page: 书写命令">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="section1.html" class="navigation navigation-next " aria-label="Next page: 使用条件判断">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"使用变量","level":"1.5","depth":1,"next":{"title":"使用条件判断","level":"1.6","depth":1,"path":"chapter2/section1.md","ref":"chapter2/section1.md","articles":[]},"previous":{"title":"书写命令","level":"1.4","depth":1,"path":"chapter1/section2.md","ref":"chapter1/section2.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapter2/README.md","mtime":"2020-03-31T08:55:43.164Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-03-31T09:25:03.917Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

