
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>书写命令 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../chapter2/" />
    
    
    <link rel="prev" href="section1.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="./">
            
                <a href="./">
            
                    
                    Makefile介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="section1.html">
            
                <a href="section1.html">
            
                    
                    书写规则
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4" data-path="section2.html">
            
                <a href="section2.html">
            
                    
                    书写命令
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../chapter2/">
            
                <a href="../chapter2/">
            
                    
                    使用变量
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="../chapter2/section1.html">
            
                <a href="../chapter2/section1.html">
            
                    
                    使用条件判断
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="../chapter2/section2.html">
            
                <a href="../chapter2/section2.html">
            
                    
                    使用函数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="../chapter3/">
            
                <a href="../chapter3/">
            
                    
                    make 的运行
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="../chapter3/section1.html">
            
                <a href="../chapter3/section1.html">
            
                    
                    隐含规则
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="../chapter3/section2.html">
            
                <a href="../chapter3/section2.html">
            
                    
                    使用make更新函数库文件
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="../end/">
            
                <a href="../end/">
            
                    
                    结束
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >书写命令</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x4E66;&#x5199;&#x547D;&#x4EE4;">&#x4E66;&#x5199;&#x547D;&#x4EE4;</h1>
<p>&#x6BCF;&#x6761;&#x89C4;&#x5219;&#x4E2D;&#x7684;&#x547D;&#x4EE4;&#x548C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;Shell&#x7684;&#x547D;&#x4EE4;&#x884C;&#x662F;&#x4E00;&#x81F4;&#x7684;&#x3002;make&#x4F1A;&#x4E00;&#x6309;&#x987A;&#x5E8F;&#x4E00;&#x6761;&#x4E00;&#x6761;&#x7684;&#x6267;&#x884C;&#x547D;&#x4EE4;&#xFF0C;&#x6BCF;&#x6761;&#x547D;&#x4EE4;&#x7684; &#x5F00;&#x5934;&#x5FC5;&#x987B;&#x4EE5; Tab &#x952E;&#x5F00;&#x5934;&#xFF0C;&#x9664;&#x975E;&#xFF0C;&#x547D;&#x4EE4;&#x662F;&#x7D27;&#x8DDF;&#x5728;&#x4F9D;&#x8D56;&#x89C4;&#x5219;&#x540E;&#x9762;&#x7684;&#x5206;&#x53F7;&#x540E;&#x7684;&#x3002;&#x5728;&#x547D;&#x4EE4;&#x884C;&#x4E4B;&#x95F4;&#x4E2D;&#x7684;&#x7A7A;&#x683C;&#x6216;&#x662F; &#x7A7A;&#x884C;&#x4F1A;&#x88AB;&#x5FFD;&#x7565;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x8BE5;&#x7A7A;&#x683C;&#x6216;&#x7A7A;&#x884C;&#x662F;&#x4EE5;Tab&#x952E;&#x5F00;&#x5934;&#x7684;&#xFF0C;&#x90A3;&#x4E48;make&#x4F1A;&#x8BA4;&#x4E3A;&#x5176;&#x662F;&#x4E00;&#x4E2A;&#x7A7A;&#x547D;&#x4EE4;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5728;UNIX&#x4E0B;&#x53EF;&#x80FD;&#x4F1A;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7684;Shell&#xFF0C;&#x4F46;&#x662F;make&#x7684;&#x547D;&#x4EE4;&#x9ED8;&#x8BA4;&#x662F;&#x88AB; /bin/sh &#x2014;&#x2014;UNIX&#x7684;&#x6807;&#x51C6;Shell &#x89E3;&#x91CA;&#x6267;&#x884C;&#x7684;&#x3002;&#x9664;&#x975E;&#x4F60;&#x7279;&#x522B;&#x6307;&#x5B9A;&#x4E00;&#x4E2A;&#x5176;&#x5B83;&#x7684;Shell&#x3002;Makefile&#x4E2D;&#xFF0C; # &#x662F;&#x6CE8;&#x91CA;&#x7B26;&#xFF0C;&#x5F88;&#x50CF;C/C++&#x4E2D;&#x7684; // &#xFF0C;&#x5176;&#x540E;&#x7684;&#x672C;&#x884C;&#x5B57;&#x7B26;&#x90FD;&#x88AB;&#x6CE8;&#x91CA;&#x3002;</p>
<h1 id="&#x663E;&#x793A;&#x547D;&#x4EE4;">&#x663E;&#x793A;&#x547D;&#x4EE4;</h1>
<p>&#x901A;&#x5E38;&#xFF0C;make&#x4F1A;&#x628A;&#x5176;&#x8981;&#x6267;&#x884C;&#x7684;&#x547D;&#x4EE4;&#x884C;&#x5728;&#x547D;&#x4EE4;&#x6267;&#x884C;&#x524D;&#x8F93;&#x51FA;&#x5230;&#x5C4F;&#x5E55;&#x4E0A;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x7528; @ &#x5B57;&#x7B26;&#x5728;&#x547D;&#x4EE4;&#x884C;&#x524D;&#xFF0C;&#x90A3;&#x4E48;&#xFF0C; &#x8FD9;&#x4E2A;&#x547D;&#x4EE4;&#x5C06;&#x4E0D;&#x88AB;make&#x663E;&#x793A;&#x51FA;&#x6765;&#xFF0C;&#x6700;&#x5177;&#x4EE3;&#x8868;&#x6027;&#x7684;&#x4F8B;&#x5B50;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x7528;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#x6765;&#x5411;&#x5C4F;&#x5E55;&#x663E;&#x793A;&#x4E00;&#x4E9B;&#x4FE1;&#x606F;&#x3002;&#x5982;:</p>
<pre><code>@echo &#x6B63;&#x5728;&#x7F16;&#x8BD1;XXX&#x6A21;&#x5757;......
</code></pre><p>&#x5F53;make&#x6267;&#x884C;&#x65F6;&#xFF0C;&#x4F1A;&#x8F93;&#x51FA;&#x201C;&#x6B63;&#x5728;&#x7F16;&#x8BD1;XXX&#x6A21;&#x5757;&#x2026;&#x2026;&#x201D;&#x5B57;&#x4E32;&#xFF0C;&#x4F46;&#x4E0D;&#x4F1A;&#x8F93;&#x51FA;&#x547D;&#x4EE4;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x201C;@&#x201D;&#xFF0C;&#x90A3;&#x4E48;&#xFF0C;make&#x5C06; &#x8F93;&#x51FA;:</p>
<pre><code>echo &#x6B63;&#x5728;&#x7F16;&#x8BD1;XXX&#x6A21;&#x5757;......&#x6B63;&#x5728;&#x7F16;&#x8BD1;XXX&#x6A21;&#x5757;......
</code></pre><p>&#x5982;&#x679C;make&#x6267;&#x884C;&#x65F6;&#xFF0C;&#x5E26;&#x5165;make&#x53C2;&#x6570; -n &#x6216; --just-print &#xFF0C;&#x90A3;&#x4E48;&#x5176;&#x53EA;&#x662F;&#x663E;&#x793A;&#x547D;&#x4EE4;&#xFF0C;&#x4F46;&#x4E0D;&#x4F1A;&#x6267;&#x884C; &#x547D;&#x4EE4;&#xFF0C;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#x5F88;&#x6709;&#x5229;&#x4E8E;&#x6211;&#x4EEC;&#x8C03;&#x8BD5;&#x6211;&#x4EEC;&#x7684;Makefile&#xFF0C;&#x770B;&#x770B;&#x6211;&#x4EEC;&#x4E66;&#x5199;&#x7684;&#x547D;&#x4EE4;&#x662F;&#x6267;&#x884C;&#x8D77;&#x6765;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x5B50;&#x7684;&#x6216;&#x662F;&#x4EC0;&#x4E48; &#x987A;&#x5E8F;&#x7684;&#x3002;</p>
<p>&#x800C;make&#x53C2;&#x6570; -s &#x6216; --silent &#x6216; --quiet &#x5219;&#x662F;&#x5168;&#x9762;&#x7981;&#x6B62;&#x547D;&#x4EE4;&#x7684;&#x663E;&#x793A;&#x3002;</p>
<h1 id="&#x547D;&#x4EE4;&#x6267;&#x884C;">&#x547D;&#x4EE4;&#x6267;&#x884C;</h1>
<p>&#x5F53;&#x4F9D;&#x8D56;&#x76EE;&#x6807;&#x65B0;&#x4E8E;&#x76EE;&#x6807;&#x65F6;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5F53;&#x89C4;&#x5219;&#x7684;&#x76EE;&#x6807;&#x9700;&#x8981;&#x88AB;&#x66F4;&#x65B0;&#x65F6;&#xFF0C;make&#x4F1A;&#x4E00;&#x6761;&#x4E00;&#x6761;&#x7684;&#x6267;&#x884C;&#x5176;&#x540E;&#x7684;&#x547D;&#x4EE4;&#x3002;&#x9700;&#x8981;&#x6CE8;&#x610F; &#x7684;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x8981;&#x8BA9;&#x4E0A;&#x4E00;&#x6761;&#x547D;&#x4EE4;&#x7684;&#x7ED3;&#x679C;&#x5E94;&#x7528;&#x5728;&#x4E0B;&#x4E00;&#x6761;&#x547D;&#x4EE4;&#x65F6;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;&#x5206;&#x53F7;&#x5206;&#x9694;&#x8FD9;&#x4E24;&#x6761;&#x547D;&#x4EE4;&#x3002;&#x6BD4;&#x5982;&#x4F60;&#x7684;&#x7B2C;&#x4E00; &#x6761;&#x547D;&#x4EE4;&#x662F;cd&#x547D;&#x4EE4;&#xFF0C;&#x4F60;&#x5E0C;&#x671B;&#x7B2C;&#x4E8C;&#x6761;&#x547D;&#x4EE4;&#x5F97;&#x5728;cd&#x4E4B;&#x540E;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x8FD0;&#x884C;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x5C31;&#x4E0D;&#x80FD;&#x628A;&#x8FD9;&#x4E24;&#x6761;&#x547D;&#x4EE4;&#x5199;&#x5728;&#x4E24;&#x884C;&#x4E0A;&#xFF0C;&#x800C; &#x5E94;&#x8BE5;&#x628A;&#x8FD9;&#x4E24;&#x6761;&#x547D;&#x4EE4;&#x5199;&#x5728;&#x4E00;&#x884C;&#x4E0A;&#xFF0C;&#x7528;&#x5206;&#x53F7;&#x5206;&#x9694;&#x3002;&#x5982;&#xFF1A;</p>
<ul>
<li>&#x793A;&#x4F8B;&#x4E00;&#xFF1A;<pre><code>exec:
cd /home/hchen
pwd
</code></pre></li>
<li>&#x793A;&#x4F8B;&#x4E8C;&#xFF1A;<pre><code>exec:
cd /home/hchen; pwd
</code></pre>&#x5F53;&#x6211;&#x4EEC;&#x6267;&#x884C; make exec &#x65F6;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#x7684;cd&#x6CA1;&#x6709;&#x4F5C;&#x7528;&#xFF0C;pwd&#x4F1A;&#x6253;&#x5370;&#x51FA;&#x5F53;&#x524D;&#x7684;Makefile&#x76EE;&#x5F55;&#xFF0C;&#x800C;&#x7B2C; &#x4E8C;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;cd&#x5C31;&#x8D77;&#x4F5C;&#x7528;&#x4E86;&#xFF0C;pwd&#x4F1A;&#x6253;&#x5370;&#x51FA;&#x201C;/home/hchen&#x201D;&#x3002;</li>
</ul>
<p>make&#x4E00;&#x822C;&#x662F;&#x4F7F;&#x7528;&#x73AF;&#x5883;&#x53D8;&#x91CF;SHELL&#x4E2D;&#x6240;&#x5B9A;&#x4E49;&#x7684;&#x7CFB;&#x7EDF;Shell&#x6765;&#x6267;&#x884C;&#x547D;&#x4EE4;&#xFF0C;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#x4F7F;&#x7528;UNIX&#x7684;&#x6807; &#x51C6;Shell&#x2014;&#x2014;/bin/sh&#x6765;&#x6267;&#x884C;&#x547D;&#x4EE4;&#x3002;&#x4F46;&#x5728;MS-DOS&#x4E0B;&#x6709;&#x70B9;&#x7279;&#x6B8A;&#xFF0C;&#x56E0;&#x4E3A;MS-DOS&#x4E0B;&#x6CA1;&#x6709;SHELL&#x73AF;&#x5883;&#x53D8;&#x91CF;&#xFF0C;&#x5F53;&#x7136;&#x4F60;&#x4E5F; &#x53EF;&#x4EE5;&#x6307;&#x5B9A;&#x3002;&#x5982;&#x679C;&#x4F60;&#x6307;&#x5B9A;&#x4E86;UNIX&#x98CE;&#x683C;&#x7684;&#x76EE;&#x5F55;&#x5F62;&#x5F0F;&#xFF0C;&#x9996;&#x5148;&#xFF0C;make&#x4F1A;&#x5728;SHELL&#x6240;&#x6307;&#x5B9A;&#x7684;&#x8DEF;&#x5F84;&#x4E2D;&#x627E;&#x5BFB;&#x547D;&#x4EE4;&#x89E3;&#x91CA;&#x5668;&#xFF0C;&#x5982; &#x679C;&#x627E;&#x4E0D;&#x5230;&#xFF0C;&#x5176;&#x4F1A;&#x5728;&#x5F53;&#x524D;&#x76D8;&#x7B26;&#x4E2D;&#x7684;&#x5F53;&#x524D;&#x76EE;&#x5F55;&#x4E2D;&#x5BFB;&#x627E;&#xFF0C;&#x5982;&#x679C;&#x518D;&#x627E;&#x4E0D;&#x5230;&#xFF0C;&#x5176;&#x4F1A;&#x5728;PATH&#x73AF;&#x5883;&#x53D8;&#x91CF;&#x4E2D;&#x6240;&#x5B9A;&#x4E49;&#x7684;&#x6240;&#x6709;&#x8DEF;&#x5F84; &#x4E2D;&#x5BFB;&#x627E;&#x3002;MS-DOS&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5B9A;&#x4E49;&#x7684;&#x547D;&#x4EE4;&#x89E3;&#x91CA;&#x5668;&#x6CA1;&#x6709;&#x627E;&#x5230;&#xFF0C;&#x5176;&#x4F1A;&#x7ED9;&#x4F60;&#x7684;&#x547D;&#x4EE4;&#x89E3;&#x91CA;&#x5668;&#x52A0;&#x4E0A;&#x8BF8;&#x5982; .exe &#x3001; .com &#x3001; .bat &#x3001; .sh &#x7B49;&#x540E;&#x7F00;&#x3002;</p>
<h1 id="&#x547D;&#x4EE4;&#x51FA;&#x9519;">&#x547D;&#x4EE4;&#x51FA;&#x9519;</h1>
<p>&#x6BCF;&#x5F53;&#x547D;&#x4EE4;&#x8FD0;&#x884C;&#x5B8C;&#x540E;&#xFF0C;make&#x4F1A;&#x68C0;&#x6D4B;&#x6BCF;&#x4E2A;&#x547D;&#x4EE4;&#x7684;&#x8FD4;&#x56DE;&#x7801;&#xFF0C;&#x5982;&#x679C;&#x547D;&#x4EE4;&#x8FD4;&#x56DE;&#x6210;&#x529F;&#xFF0C;&#x90A3;&#x4E48;make&#x4F1A;&#x6267;&#x884C;&#x4E0B;&#x4E00;&#x6761;&#x547D;&#x4EE4;&#xFF0C;&#x5F53;&#x89C4; &#x5219;&#x4E2D;&#x6240;&#x6709;&#x7684;&#x547D;&#x4EE4;&#x6210;&#x529F;&#x8FD4;&#x56DE;&#x540E;&#xFF0C;&#x8FD9;&#x4E2A;&#x89C4;&#x5219;&#x5C31;&#x7B97;&#x662F;&#x6210;&#x529F;&#x5B8C;&#x6210;&#x4E86;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x89C4;&#x5219;&#x4E2D;&#x7684;&#x67D0;&#x4E2A;&#x547D;&#x4EE4;&#x51FA;&#x9519;&#x4E86;&#xFF08;&#x547D;&#x4EE4;&#x9000;&#x51FA;&#x7801; &#x975E;&#x96F6;&#xFF09;&#xFF0C;&#x90A3;&#x4E48;make&#x5C31;&#x4F1A;&#x7EC8;&#x6B62;&#x6267;&#x884C;&#x5F53;&#x524D;&#x89C4;&#x5219;&#xFF0C;&#x8FD9;&#x5C06;&#x6709;&#x53EF;&#x80FD;&#x7EC8;&#x6B62;&#x6240;&#x6709;&#x89C4;&#x5219;&#x7684;&#x6267;&#x884C;&#x3002;</p>
<p>&#x6709;&#x4E9B;&#x65F6;&#x5019;&#xFF0C;&#x547D;&#x4EE4;&#x7684;&#x51FA;&#x9519;&#x5E76;&#x4E0D;&#x8868;&#x793A;&#x5C31;&#x662F;&#x9519;&#x8BEF;&#x7684;&#x3002;&#x4F8B;&#x5982;mkdir&#x547D;&#x4EE4;&#xFF0C;&#x6211;&#x4EEC;&#x4E00;&#x5B9A;&#x9700;&#x8981;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x76EE;&#x5F55;&#xFF0C;&#x5982;&#x679C;&#x76EE;&#x5F55;&#x4E0D;&#x5B58; &#x5728;&#xFF0C;&#x90A3;&#x4E48;mkdir&#x5C31;&#x6210;&#x529F;&#x6267;&#x884C;&#xFF0C;&#x4E07;&#x4E8B;&#x5927;&#x5409;&#xFF0C;&#x5982;&#x679C;&#x76EE;&#x5F55;&#x5B58;&#x5728;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x51FA;&#x9519;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x4E4B;&#x6240;&#x4EE5;&#x4F7F;&#x7528;mkdir&#x7684;&#x610F;&#x601D;&#x5C31;&#x662F; &#x4E00;&#x5B9A;&#x8981;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x4E00;&#x4E2A;&#x76EE;&#x5F55;&#xFF0C;&#x4E8E;&#x662F;&#x6211;&#x4EEC;&#x5C31;&#x4E0D;&#x5E0C;&#x671B;mkdir&#x51FA;&#x9519;&#x800C;&#x7EC8;&#x6B62;&#x89C4;&#x5219;&#x7684;&#x8FD0;&#x884C;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x505A;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x5FFD;&#x7565;&#x547D;&#x4EE4;&#x7684;&#x51FA;&#x9519;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;Makefile&#x7684;&#x547D;&#x4EE4;&#x884C;&#x524D;&#x52A0;&#x4E00;&#x4E2A;&#x51CF;&#x53F7; - &#xFF08;&#x5728;Tab&#x952E;&#x4E4B;&#x540E;&#xFF09; &#xFF0C;&#x6807;&#x8BB0;&#x4E3A;&#x4E0D;&#x7BA1;&#x547D;&#x4EE4;&#x51FA;&#x4E0D;&#x51FA;&#x9519;&#x90FD;&#x8BA4;&#x4E3A;&#x662F;&#x6210;&#x529F;&#x7684;&#x3002;&#x5982;&#xFF1A;</p>
<pre><code>clean:
-rm -f *.o
</code></pre><p>&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x5168;&#x5C40;&#x7684;&#x529E;&#x6CD5;&#x662F;&#xFF0C;&#x7ED9;make&#x52A0;&#x4E0A; -i &#x6216;&#x662F; --ignore-errors &#x53C2;&#x6570;&#xFF0C;&#x90A3;&#x4E48;&#xFF0C;Makefile&#x4E2D; &#x6240;&#x6709;&#x547D;&#x4EE4;&#x90FD;&#x4F1A;&#x5FFD;&#x7565;&#x9519;&#x8BEF;&#x3002;&#x800C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x89C4;&#x5219;&#x662F;&#x4EE5; .IGNORE &#x4F5C;&#x4E3A;&#x76EE;&#x6807;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x89C4;&#x5219;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x547D;&#x4EE4;&#x5C06;&#x4F1A; &#x5FFD;&#x7565;&#x9519;&#x8BEF;&#x3002;&#x8FD9;&#x4E9B;&#x662F;&#x4E0D;&#x540C;&#x7EA7;&#x522B;&#x7684;&#x9632;&#x6B62;&#x547D;&#x4EE4;&#x51FA;&#x9519;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x4F60;&#x7684;&#x4E0D;&#x540C;&#x559C;&#x6B22;&#x8BBE;&#x7F6E;&#x3002;</p>
<p>&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x8981;&#x63D0;&#x4E00;&#x4E0B;&#x7684;make&#x7684;&#x53C2;&#x6570;&#x7684;&#x662F; -k &#x6216;&#x662F; --keep-going &#xFF0C;&#x8FD9;&#x4E2A;&#x53C2;&#x6570;&#x7684;&#x610F;&#x601D;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x67D0; &#x89C4;&#x5219;&#x4E2D;&#x7684;&#x547D;&#x4EE4;&#x51FA;&#x9519;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x7EC8;&#x6B62;&#x8BE5;&#x89C4;&#x5219;&#x7684;&#x6267;&#x884C;&#xFF0C;&#x4F46;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#x5176;&#x5B83;&#x89C4;&#x5219;&#x3002;</p>
<h1 id="&#x5D4C;&#x5957;&#x6267;&#x884C;make">&#x5D4C;&#x5957;&#x6267;&#x884C;make</h1>
<p>&#x5728;&#x4E00;&#x4E9B;&#x5927;&#x7684;&#x5DE5;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x628A;&#x6211;&#x4EEC;&#x4E0D;&#x540C;&#x6A21;&#x5757;&#x6216;&#x662F;&#x4E0D;&#x540C;&#x529F;&#x80FD;&#x7684;&#x6E90;&#x6587;&#x4EF6;&#x653E;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x76EE;&#x5F55;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x6BCF;&#x4E2A;&#x76EE;&#x5F55; &#x4E2D;&#x90FD;&#x4E66;&#x5199;&#x4E00;&#x4E2A;&#x8BE5;&#x76EE;&#x5F55;&#x7684;Makefile&#xFF0C;&#x8FD9;&#x6709;&#x5229;&#x4E8E;&#x8BA9;&#x6211;&#x4EEC;&#x7684;Makefile&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x5730;&#x7B80;&#x6D01;&#xFF0C;&#x800C;&#x4E0D;&#x81F3;&#x4E8E;&#x628A;&#x6240;&#x6709;&#x7684;&#x4E1C;&#x897F;&#x5168; &#x90E8;&#x5199;&#x5728;&#x4E00;&#x4E2A;Makefile&#x4E2D;&#xFF0C;&#x8FD9;&#x6837;&#x4F1A;&#x5F88;&#x96BE;&#x7EF4;&#x62A4;&#x6211;&#x4EEC;&#x7684;Makefile&#xFF0C;&#x8FD9;&#x4E2A;&#x6280;&#x672F;&#x5BF9;&#x4E8E;&#x6211;&#x4EEC;&#x6A21;&#x5757;&#x7F16;&#x8BD1;&#x548C;&#x5206;&#x6BB5;&#x7F16;&#x8BD1;&#x6709;&#x7740;&#x975E; &#x5E38;&#x5927;&#x7684;&#x597D;&#x5904;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x4E00;&#x4E2A;&#x5B50;&#x76EE;&#x5F55;&#x53EB;subdir&#xFF0C;&#x8FD9;&#x4E2A;&#x76EE;&#x5F55;&#x4E0B;&#x6709;&#x4E2A;Makefile&#x6587;&#x4EF6;&#xFF0C;&#x6765;&#x6307;&#x660E;&#x4E86;&#x8FD9;&#x4E2A;&#x76EE;&#x5F55;&#x4E0B;&#x6587;&#x4EF6;&#x7684;&#x7F16;&#x8BD1;&#x89C4;&#x5219; &#x3002;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x603B;&#x63A7;&#x7684;Makefile&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x4E66;&#x5199;&#xFF1A;</p>
<pre><code>subsystem:
cd subdir &amp;&amp; $(MAKE)
</code></pre><p>&#x5176;&#x7B49;&#x4EF7;&#x4E8E;&#xFF1A;</p>
<pre><code>subsystem:
$(MAKE) -C subdir
</code></pre><p>&#x5B9A;&#x4E49;$(MAKE)&#x5B8F;&#x53D8;&#x91CF;&#x7684;&#x610F;&#x601D;&#x662F;&#xFF0C;&#x4E5F;&#x8BB8;&#x6211;&#x4EEC;&#x7684;make&#x9700;&#x8981;&#x4E00;&#x4E9B;&#x53C2;&#x6570;&#xFF0C;&#x6240;&#x4EE5;&#x5B9A;&#x4E49;&#x6210;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x6BD4;&#x8F83;&#x5229;&#x4E8E;&#x7EF4;&#x62A4;&#x3002;&#x8FD9;&#x4E24;&#x4E2A; &#x4F8B;&#x5B50;&#x7684;&#x610F;&#x601D;&#x90FD;&#x662F;&#x5148;&#x8FDB;&#x5165;&#x201C;subdir&#x201D;&#x76EE;&#x5F55;&#xFF0C;&#x7136;&#x540E;&#x6267;&#x884C;make&#x547D;&#x4EE4;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x628A;&#x8FD9;&#x4E2A;Makefile&#x53EB;&#x505A;&#x201C;&#x603B;&#x63A7;Makefile&#x201D;&#xFF0C;&#x603B;&#x63A7;Makefile&#x7684;&#x53D8;&#x91CF;&#x53EF;&#x4EE5;&#x4F20;&#x9012;&#x5230;&#x4E0B;&#x7EA7;&#x7684;Makefile&#x4E2D;&#xFF08;&#x5982;&#x679C; &#x4F60;&#x663E;&#x793A;&#x7684;&#x58F0;&#x660E;&#xFF09;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x4F1A;&#x8986;&#x76D6;&#x4E0B;&#x5C42;&#x7684;Makefile&#x4E2D;&#x6240;&#x5B9A;&#x4E49;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x9664;&#x975E;&#x6307;&#x5B9A;&#x4E86; -e &#x53C2;&#x6570;&#x3002;
&#x5982;&#x679C;&#x4F60;&#x8981;&#x4F20;&#x9012;&#x53D8;&#x91CF;&#x5230;&#x4E0B;&#x7EA7;Makefile&#x4E2D;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8FD9;&#x6837;&#x7684;&#x58F0;&#x660E;:</p>
<pre><code>export &lt;variable ...&gt;;
</code></pre><p>&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x60F3;&#x8BA9;&#x67D0;&#x4E9B;&#x53D8;&#x91CF;&#x4F20;&#x9012;&#x5230;&#x4E0B;&#x7EA7;Makefile&#x4E2D;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x58F0;&#x660E;:</p>
<pre><code>unexport &lt;variable ...&gt;;
</code></pre><p>&#x5982;&#xFF1A;</p>
<ul>
<li>&#x793A;&#x4F8B;&#x4E00;&#xFF1A;<pre><code>export variable = value
</code></pre>&#x5176;&#x7B49;&#x4EF7;&#x4E8E;&#xFF1A;<pre><code>variable = value
export variable
</code></pre>&#x5176;&#x7B49;&#x4EF7;&#x4E8E;&#xFF1A;<pre><code>export variable := value
</code></pre>&#x5176;&#x7B49;&#x4EF7;&#x4E8E;&#xFF1A;<pre><code>variable := value
export variable
</code></pre></li>
<li>&#x793A;&#x4F8B;&#x4E8C;&#xFF1A;<pre><code>export variable += value
</code></pre>&#x5176;&#x7B49;&#x4EF7;&#x4E8E;&#xFF1A;<pre><code>variable += value
export variable
</code></pre>&#x5982;&#x679C;&#x4F60;&#x8981;&#x4F20;&#x9012;&#x6240;&#x6709;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x90A3;&#x4E48;&#xFF0C;&#x53EA;&#x8981;&#x4E00;&#x4E2A;export&#x5C31;&#x884C;&#x4E86;&#x3002;&#x540E;&#x9762;&#x4EC0;&#x4E48;&#x4E5F;&#x4E0D;&#x7528;&#x8DDF;&#xFF0C;&#x8868;&#x793A;&#x4F20;&#x9012;&#x6240;&#x6709;&#x7684;&#x53D8;&#x91CF;&#x3002;</li>
</ul>
<p>&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x6709;&#x4E24;&#x4E2A;&#x53D8;&#x91CF;&#xFF0C;&#x4E00;&#x4E2A;&#x662F; SHELL &#xFF0C;&#x4E00;&#x4E2A;&#x662F; MAKEFLAGS &#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x53D8;&#x91CF;&#x4E0D;&#x7BA1;&#x4F60;&#x662F; &#x5426;export&#xFF0C;&#x5176;&#x603B;&#x662F;&#x8981;&#x4F20;&#x9012;&#x5230;&#x4E0B;&#x5C42; Makefile&#x4E2D;&#xFF0C;&#x7279;&#x522B;&#x662F; MAKEFLAGS &#x53D8;&#x91CF;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x542B;&#x4E86;make&#x7684;&#x53C2;&#x6570; &#x4FE1;&#x606F;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x6267;&#x884C;&#x201C;&#x603B;&#x63A7;Makefile&#x201D;&#x65F6;&#x6709;make&#x53C2;&#x6570;&#x6216;&#x662F;&#x5728;&#x4E0A;&#x5C42; Makefile&#x4E2D;&#x5B9A;&#x4E49;&#x4E86;&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#xFF0C;&#x90A3;&#x4E48; MAKEFLAGS &#x53D8;&#x91CF;&#x5C06;&#x4F1A;&#x662F;&#x8FD9;&#x4E9B;&#x53C2;&#x6570;&#xFF0C;&#x5E76;&#x4F1A;&#x4F20;&#x9012;&#x5230;&#x4E0B;&#x5C42;Makefile&#x4E2D;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x7EA7;&#x7684;&#x73AF;&#x5883;&#x53D8;&#x91CF;&#x3002;</p>
<p>&#x4F46;&#x662F;make&#x547D;&#x4EE4;&#x4E2D;&#x7684;&#x6709;&#x51E0;&#x4E2A;&#x53C2;&#x6570;&#x5E76;&#x4E0D;&#x5F80;&#x4E0B;&#x4F20;&#x9012;&#xFF0C;&#x5B83;&#x4EEC;&#x662F; -C , -f , -h, -o &#x548C; -W &#xFF08;&#x6709;&#x5173;Makefile&#x53C2;&#x6570;&#x7684;&#x7EC6;&#x8282;&#x5C06;&#x5728;&#x540E;&#x9762;&#x8BF4;&#x660E;&#xFF09;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x60F3;&#x5F80;&#x4E0B;&#x5C42;&#x4F20;&#x9012;&#x53C2;&#x6570;&#xFF0C;&#x90A3;&#x4E48;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x6765;&#xFF1A;</p>
<pre><code>subsystem:
cd subdir &amp;&amp; $(MAKE) MAKEFLAGS=
</code></pre><p>&#x5982;&#x679C;&#x4F60;&#x5B9A;&#x4E49;&#x4E86;&#x73AF;&#x5883;&#x53D8;&#x91CF; MAKEFLAGS &#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x5F97;&#x786E;&#x4FE1;&#x5176;&#x4E2D;&#x7684;&#x9009;&#x9879;&#x662F;&#x5927;&#x5BB6;&#x90FD;&#x4F1A;&#x7528;&#x5230;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x5176;&#x4E2D;&#x6709; -t , -n &#x548C; -q &#x53C2;&#x6570;&#xFF0C;&#x90A3;&#x4E48;&#x5C06;&#x4F1A;&#x6709;&#x8BA9;&#x4F60;&#x610F;&#x60F3;&#x4E0D;&#x5230;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x6216;&#x8BB8;&#x4F1A;&#x8BA9;&#x4F60;&#x5F02;&#x5E38;&#x5730;&#x6050;&#x614C;&#x3002;</p>
<p>&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x5728;&#x201C;&#x5D4C;&#x5957;&#x6267;&#x884C;&#x201D;&#x4E2D;&#x6BD4;&#x8F83;&#x6709;&#x7528;&#x7684;&#x53C2;&#x6570;&#xFF0C; -w &#x6216;&#x662F; --print-directory &#x4F1A;&#x5728;make&#x7684;&#x8FC7;&#x7A0B; &#x4E2D;&#x8F93;&#x51FA;&#x4E00;&#x4E9B;&#x4FE1;&#x606F;&#xFF0C;&#x8BA9;&#x4F60;&#x770B;&#x5230;&#x76EE;&#x524D;&#x7684;&#x5DE5;&#x4F5C;&#x76EE;&#x5F55;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x7684;&#x4E0B;&#x7EA7;make&#x76EE;&#x5F55; &#x662F;&#x201C;/home/hchen/gnu/make&#x201D;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x4F7F;&#x7528; make -w &#x6765;&#x6267;&#x884C;&#xFF0C;&#x90A3;&#x4E48;&#x5F53;&#x8FDB;&#x5165;&#x8BE5;&#x76EE;&#x5F55;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x770B; &#x5230;:</p>
<pre><code>make: Entering directory `/home/hchen/gnu/make&apos;.
</code></pre><p>&#x800C;&#x5728;&#x5B8C;&#x6210;&#x4E0B;&#x5C42;make&#x540E;&#x79BB;&#x5F00;&#x76EE;&#x5F55;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x770B;&#x5230;:</p>
<pre><code>make: Leaving directory `/home/hchen/gnu/make&apos;
</code></pre><p>&#x5F53;&#x4F60;&#x4F7F;&#x7528; -C &#x53C2;&#x6570;&#x6765;&#x6307;&#x5B9A;make&#x4E0B;&#x5C42;Makefile&#x65F6;&#xFF0C; -w &#x4F1A;&#x88AB;&#x81EA;&#x52A8;&#x6253;&#x5F00;&#x7684;&#x3002;&#x5982;&#x679C;&#x53C2;&#x6570;&#x4E2D;&#x6709; -s &#xFF08; --slient &#xFF09;&#x6216;&#x662F; --no-print-directory &#xFF0C;&#x90A3;&#x4E48;&#xFF0C; -w &#x603B;&#x662F;&#x5931;&#x6548;&#x7684;&#x3002;</p>
<h1 id="&#x5B9A;&#x4E49;&#x547D;&#x4EE4;&#x5305;">&#x5B9A;&#x4E49;&#x547D;&#x4EE4;&#x5305;</h1>
<p>&#x5982;&#x679C;Makefile&#x4E2D;&#x51FA;&#x73B0;&#x4E00;&#x4E9B;&#x76F8;&#x540C;&#x547D;&#x4EE4;&#x5E8F;&#x5217;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4E3A;&#x8FD9;&#x4E9B;&#x76F8;&#x540C;&#x7684;&#x547D;&#x4EE4;&#x5E8F;&#x5217;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x3002;&#x5B9A;&#x4E49;&#x8FD9;&#x79CD;&#x547D;&#x4EE4; &#x5E8F;&#x5217;&#x7684;&#x8BED;&#x6CD5;&#x4EE5; define &#x5F00;&#x59CB;&#xFF0C;&#x4EE5; endef &#x7ED3;&#x675F;&#xFF0C;&#x5982;:</p>
<pre><code>define run-yacc
yacc $(firstword $^)
mv y.tab.c $@
endef
</code></pre><p>&#x8FD9;&#x91CC;&#xFF0C;&#x201C;run-yacc&#x201D;&#x662F;&#x8FD9;&#x4E2A;&#x547D;&#x4EE4;&#x5305;&#x7684;&#x540D;&#x5B57;&#xFF0C;&#x5176;&#x4E0D;&#x8981;&#x548C;Makefile&#x4E2D;&#x7684;&#x53D8;&#x91CF;&#x91CD;&#x540D;&#x3002;&#x5728; define &#x548C; endef &#x4E2D;&#x7684;&#x4E24;&#x884C;&#x5C31;&#x662F;&#x547D;&#x4EE4;&#x5E8F;&#x5217;&#x3002;&#x8FD9;&#x4E2A;&#x547D;&#x4EE4;&#x5305;&#x4E2D;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x547D;&#x4EE4;&#x662F;&#x8FD0;&#x884C;Yacc&#x7A0B;&#x5E8F;&#xFF0C;&#x56E0;&#x4E3A;Yacc&#x7A0B;&#x5E8F;&#x603B;&#x662F;&#x751F; &#x6210;&#x201C;y.tab.c&#x201D;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x6240;&#x4EE5;&#x7B2C;&#x4E8C;&#x884C;&#x7684;&#x547D;&#x4EE4;&#x5C31;&#x662F;&#x628A;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x6539;&#x6539;&#x540D;&#x5B57;&#x3002;&#x8FD8;&#x662F;&#x628A;&#x8FD9;&#x4E2A;&#x547D;&#x4EE4;&#x5305;&#x653E;&#x5230;&#x4E00;&#x4E2A;&#x793A;&#x4F8B;&#x4E2D;&#x6765;&#x770B; &#x770B;&#x5427;&#x3002;</p>
<pre><code>foo.c : foo.y
$(run-yacc)
</code></pre><p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x89C1;&#xFF0C;&#x8981;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x547D;&#x4EE4;&#x5305;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x597D;&#x50CF;&#x4F7F;&#x7528;&#x53D8;&#x91CF;&#x4E00;&#x6837;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x547D;&#x4EE4;&#x5305;&#x7684;&#x4F7F;&#x7528;&#x4E2D;&#xFF0C;&#x547D;&#x4EE4; &#x5305;&#x201C;run-yacc&#x201D;&#x4E2D;&#x7684; $^ &#x5C31;&#x662F; foo.y &#xFF0C; $@ &#x5C31;&#x662F; foo.c &#xFF08;&#x6709;&#x5173;&#x8FD9;&#x79CD;&#x4EE5; $ &#x5F00;&#x5934;&#x7684;&#x7279;&#x6B8A;&#x53D8;&#x91CF;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x5728;&#x540E;&#x9762;&#x4ECB;&#x7ECD;&#xFF09;&#xFF0C;make&#x5728;&#x6267;&#x884C;&#x547D;&#x4EE4;&#x5305;&#x65F6;&#xFF0C;&#x547D;&#x4EE4;&#x5305;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x547D;&#x4EE4;&#x4F1A;&#x88AB;&#x4F9D;&#x6B21;&#x72EC;&#x7ACB;&#x6267;&#x884C;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="section1.html" class="navigation navigation-prev " aria-label="Previous page: 书写规则">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../chapter2/" class="navigation navigation-next " aria-label="Next page: 使用变量">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"书写命令","level":"1.4","depth":1,"next":{"title":"使用变量","level":"1.5","depth":1,"path":"chapter2/README.md","ref":"chapter2/README.md","articles":[]},"previous":{"title":"书写规则","level":"1.3","depth":1,"path":"chapter1/section1.md","ref":"chapter1/section1.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapter1/section2.md","mtime":"2020-03-27T10:15:08.337Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-03-31T10:28:16.511Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

